tangyangguang/Esp32Base/test/test_native_record_store_harness/test_main.cpp
#include <unity.h>

#include <algorithm>
#include <map>
#include <set>
#include <string>
#include <vector>

#include "runtime/Esp32BaseFs.h"
#include "runtime/Esp32BaseConditions.h"
#include "runtime/Esp32BaseRecordStore.h"
#include "runtime/Esp32BaseStorage.h"
#include "runtime/Esp32BaseTime.h"
#include "core/internal/Esp32BaseConfigInternal.h"
#include "runtime/internal/Esp32BaseFsInternal.h"

namespace {

std::map<std::string, std::vector<uint8_t>> g_files;
std::set<std::string> g_directories;
std::set<std::string> g_removeFailurePaths;
size_t g_totalBytes = 1024 * 1024;
Esp32BaseTime::Snapshot g_time = {false, Esp32BaseTime::SOURCE_UPTIME, 0, 10, 1, 0};
uint32_t g_fixedSlotVisitCalls = 0;
uint32_t g_eventStoreWriteAttempts = 0;
uint32_t g_controlWriteAttempts = 0;
uint32_t g_storageInfoCalls = 0;
bool g_storageInfoFails = false;
uint32_t g_persistedActiveConditionIdBits = 0;
uint32_t g_conditionStateWriteCount = 0;
bool g_conditionStateExists = false;
bool g_conditionStateReadFails = false;
bool g_conditionStateWriteFails = false;
bool g_fileSystemWriteFails = false;
bool g_segmentCreateFails = false;
bool g_fsMaintenance = false;
bool g_fsWritesSuspended = false;

void resetHarness() {
    g_files.clear();
    g_directories.clear();
    g_directories.insert("/");
    g_removeFailurePaths.clear();
    g_totalBytes = 1024 * 1024;
    g_time = {false, Esp32BaseTime::SOURCE_UPTIME, 0, 10, 1, 0};
    g_fixedSlotVisitCalls = 0;
    g_eventStoreWriteAttempts = 0;
    g_controlWriteAttempts = 0;
    g_storageInfoCalls = 0;
    g_storageInfoFails = false;
    g_persistedActiveConditionIdBits = 0;
    g_conditionStateWriteCount = 0;
    g_conditionStateExists = false;
    g_conditionStateReadFails = false;
    g_conditionStateWriteFails = false;
    g_fileSystemWriteFails = false;
    g_segmentCreateFails = false;
    g_fsMaintenance = false;
    g_fsWritesSuspended = false;
    nativeMillisValue() = 0;
}

Esp32BaseRecordStore::StoreDefinition definition(const char* name = "watering",
                                                  uint16_t version = 1,
                                                  uint32_t maximumBytes = 224,
                                                  uint32_t minimumFreeBytes = 0) {
    Esp32BaseRecordStore::StoreDefinition value;
    value.recordTypeName = name;
    value.storeVersion = version;
    value.payloadSizeBytes = 8;
    value.maximumStoreBytes = maximumBytes;
    value.minimumFileSystemFreeBytes = minimumFreeBytes;
    return value;
}

void payload(uint8_t* out, uint32_t value) {
    for (size_t i = 0; i < 8; ++i) out[i] = static_cast<uint8_t>(value + i);
}

struct IdCollector {
    std::vector<uint32_t> ids;
};

void collectId(const Esp32BaseRecordStore::RecordView& record, void* user) {
    static_cast<IdCollector*>(user)->ids.push_back(record.recordId);
}

} // namespace

bool Esp32BaseFs::begin() { return true; }
bool Esp32BaseFs::isReady() { return true; }
bool Esp32BaseFs::format() { g_files.clear(); return true; }
bool Esp32BaseFs::createFixedFile(const char* path, uint32_t size, uint8_t fillByte) {
    g_files[path] = std::vector<uint8_t>(size, fillByte);
    return true;
}
bool Esp32BaseFs::writeBytes(const char* path, const uint8_t* data, size_t length) {
    if (!path || (!data && length > 0)) return false;
    g_files[path] = std::vector<uint8_t>(data, data + length);
    return true;
}
bool Esp32BaseFs::readBytes(const char* path, uint8_t* out, size_t maximum, size_t* readLength) {
    return readBytesAt(path, 0, out, maximum, readLength);
}
bool Esp32BaseFs::appendBytes(const char* path, const uint8_t* data, size_t length) {
    auto found = g_files.find(path ? path : "");
    if (found == g_files.end() || (!data && length > 0)) return false;
    found->second.insert(found->second.end(), data, data + length);
    return true;
}
bool Esp32BaseFs::readBytesAt(const char* path, uint32_t offset, uint8_t* out, size_t maximum, size_t* readLength) {
    if (readLength) *readLength = 0;
    auto found = g_files.find(path ? path : "");
    if (found == g_files.end() || !out || offset > found->second.size()) return false;
    const size_t length = std::min(maximum, found->second.size() - offset);
    std::copy(found->second.begin() + offset, found->second.begin() + offset + length, out);
    if (readLength) *readLength = length;
    return true;
}
bool Esp32BaseFs::writeBytesAt(const char* path, uint32_t offset, const uint8_t* data, size_t length) {
    if (path && std::string(path).find("/control.bin") != std::string::npos) ++g_controlWriteAttempts;
    if (g_fileSystemWriteFails || g_fsWritesSuspended) return false;
    auto found = g_files.find(path ? path : "");
    if (found == g_files.end() || (!data && length > 0) || offset > found->second.size() || length > found->second.size() - offset) return false;
    std::copy(data, data + length, found->second.begin() + offset);
    return true;
}
Esp32BaseFs::RemoveFileResult Esp32BaseFs::removeFileWithRecovery(const char* path) {
    if (g_removeFailurePaths.count(path ? path : "")) return REMOVE_FILE_FAILED;
    return g_files.erase(path ? path : "") ? REMOVE_FILE_DELETED : REMOVE_FILE_FAILED;
}
bool Esp32BaseFs::removeFile(const char* path) { return g_files.erase(path ? path : "") != 0; }
bool Esp32BaseFs::rename(const char* from, const char* to) {
    auto found = g_files.find(from ? from : "");
    if (found == g_files.end() || g_files.count(to ? to : "")) return false;
    g_files[to] = found->second;
    g_files.erase(found);
    return true;
}
bool Esp32BaseFs::exists(const char* path) {
    const std::string value = path ? path : "";
    return g_files.count(value) || g_directories.count(value);
}
int64_t Esp32BaseFs::fileSize(const char* path) {
    auto found = g_files.find(path ? path : "");
    return found == g_files.end() ? -1 : static_cast<int64_t>(found->second.size());
}
bool Esp32BaseFs::mkdir(const char* path) {
    const std::string value = path ? path : "";
    const size_t slash = value.find_last_of('/');
    const std::string parent = slash == 0 ? "/" : value.substr(0, slash);
    if (value.empty() || !g_directories.count(parent)) return false;
    g_directories.insert(value);
    return true;
}
bool Esp32BaseFs::rmdir(const char* path) { return g_directories.erase(path ? path : "") != 0; }
bool Esp32BaseFs::listDirInfo(const char* path, ListInfoCallback callback, void* user) {
    const std::string root = path ? path : "";
    if (!callback || !g_directories.count(root)) return false;
    const std::string prefix = root == "/" ? "/" : root + "/";
    for (const auto& entry : g_files) {
        if (entry.first.compare(0, prefix.size(), prefix) != 0) continue;
        const std::string remainder = entry.first.substr(prefix.size());
        if (remainder.empty() || remainder.find('/') != std::string::npos) continue;
        EntryInfo info = {entry.first.c_str(), entry.second.size(), false, 0};
        callback(info, user);
    }
    for (const std::string& directory : g_directories) {
        if (directory == root || directory.compare(0, prefix.size(), prefix) != 0) continue;
        const std::string remainder = directory.substr(prefix.size());
        if (remainder.empty() || remainder.find('/') != std::string::npos) continue;
        EntryInfo info = {directory.c_str(), 0, true, 0};
        callback(info, user);
    }
    return true;
}
bool Esp32BaseFs::listDir(const char* path, ListCallback callback, void* user) {
    struct Frame { ListCallback callback; void* user; } frame = {callback, user};
    return listDirInfo(path, [](const EntryInfo& entry, void* value) {
        Frame* frame = static_cast<Frame*>(value);
        frame->callback(entry.name, entry.size, entry.isDir, frame->user);
    }, &frame);
}
bool Esp32BaseFs::storageInfo(size_t& total, size_t& used) {
    ++g_storageInfoCalls;
    total = g_totalBytes;
    used = 0;
    for (const auto& entry : g_files) used += entry.second.size();
    return !g_storageInfoFails;
}
size_t Esp32BaseFs::totalBytes() { size_t total=0, used=0; return storageInfo(total,used) ? total : 0; }
size_t Esp32BaseFs::usedBytes() { size_t total=0, used=0; return storageInfo(total,used) ? used : 0; }
size_t Esp32BaseFs::freeBytes() {
    size_t total=0, used=0;
    return storageInfo(total,used) && total > used ? total-used : 0;
}

