tangyangguang/Esp32Base/test/test_native_record_store_harness/test_main.cpp
bool esp32base_internal::fsWriteSegmentsAt(const char* path,
                                           uint32_t offset,
                                           const FsWriteSegment* segments,
                                           size_t segmentCount) {
    ++g_eventStoreWriteAttempts;
    if (g_fileSystemWriteFails) return false;
    for (size_t i = 0; i < segmentCount; ++i) {
        if (!Esp32BaseFs::writeBytesAt(path, offset, segments[i].data, segments[i].length)) return false;
        offset += static_cast<uint32_t>(segments[i].length);
    }
    return true;
}

bool esp32base_internal::fsCreateWithSegments(const char* path,
                                               const FsWriteSegment* segments,
                                               size_t segmentCount) {
    ++g_eventStoreWriteAttempts;
    if (g_fileSystemWriteFails || g_segmentCreateFails || Esp32BaseFs::exists(path)) return false;
    std::vector<uint8_t> bytes;
    for (size_t i = 0; i < segmentCount; ++i) {
        bytes.insert(bytes.end(), segments[i].data, segments[i].data + segments[i].length);
    }
    g_files[path ? path : ""] = bytes;
    return true;
}

bool esp32base_internal::fsAppendSegments(const char* path,
                                           const FsWriteSegment* segments,
                                           size_t segmentCount) {
    ++g_eventStoreWriteAttempts;
    if (g_fileSystemWriteFails || g_fsWritesSuspended) return false;
    auto found = g_files.find(path ? path : "");
    if (found == g_files.end()) return false;
    for (size_t i = 0; i < segmentCount; ++i) {
        found->second.insert(found->second.end(), segments[i].data,
                             segments[i].data + segments[i].length);
    }
    return true;
}

bool esp32base_internal::fsBeginExclusiveMaintenance() {
    if (g_fsMaintenance || g_fsWritesSuspended) return false;
    g_fsMaintenance = true;
    return true;
}

void esp32base_internal::fsEndExclusiveMaintenance() {
    g_fsMaintenance = false;
}

bool esp32base_internal::fsSetWritesSuspended(bool suspended) {
    if (g_fsMaintenance) return false;
    g_fsWritesSuspended = suspended;
    return true;
}

bool esp32base_internal::fsWritesSuspended() {
    return g_fsWritesSuspended;
}

bool esp32base_internal::fsCurrentTaskInOperation() {
    return false;
}

bool esp32base_internal::fsVisitBytesAt(const char* path,
                                        uint32_t offset,
                                        uint32_t length,
                                        FsReadVisitor visitor,
                                        void* user) {
    std::vector<uint8_t> buffer(length);
    size_t readLength = 0;
    return Esp32BaseFs::readBytesAt(path, offset, buffer.data(), buffer.size(), &readLength) &&
           readLength == length && visitor(buffer.data(), buffer.size(), user);
}

bool esp32base_internal::fsVisitFixedSlots(const char* path,
                                           uint32_t dataOffset,
                                           uint32_t slotSize,
                                           uint32_t capacity,
                                           uint32_t firstSlot,
                                           uint32_t slotCount,
                                           bool descending,
                                           FsFixedSlotVisitor visitor,
                                           void* user) {
    ++g_fixedSlotVisitCalls;
    auto found = g_files.find(path ? path : "");
    if (found == g_files.end() || slotSize == 0 || capacity == 0 || firstSlot >= capacity ||
        slotCount > capacity || !visitor ||
        static_cast<uint64_t>(dataOffset) + static_cast<uint64_t>(slotSize) * capacity > found->second.size()) {
        return false;
    }
    uint32_t slot = firstSlot;
    for (uint32_t visited = 0; visited < slotCount; ++visited) {
        const uint32_t offset = dataOffset + slot * slotSize;
        if (!visitor(slot, 0, found->second.data() + offset, slotSize, user)) return false;
        if (descending) slot = slot == 0 ? capacity - 1U : slot - 1U;
        else slot = slot + 1U == capacity ? 0 : slot + 1U;
    }
    return true;
}

Esp32BaseTime::Snapshot Esp32BaseTime::snapshot() { return g_time; }
bool Esp32BaseTime::resolveCurrentBootEvent(uint32_t bootId, uint32_t uptimeSec, uint32_t* epochSec) {
    if (!epochSec || !g_time.synced || bootId != g_time.bootId || g_time.bootStartEpochSec == 0) return false;
    *epochSec = g_time.bootStartEpochSec + uptimeSec;
    return true;
}

esp32base_internal::ConfigUInt32ReadResult esp32base_internal::readConfigUInt32(
    const char*, const char*, uint32_t& value) {
    if (g_conditionStateReadFails) return ConfigUInt32ReadResult::Error;
    if (!g_conditionStateExists) {
        value = 0;
        return ConfigUInt32ReadResult::NotFound;
    }
    value = g_persistedActiveConditionIdBits;
    return ConfigUInt32ReadResult::Found;
}

bool esp32base_internal::writeConfigUInt32(const char*, const char*, uint32_t value) {
    ++g_conditionStateWriteCount;
    if (g_conditionStateWriteFails) return false;
    g_persistedActiveConditionIdBits = value;
    g_conditionStateExists = true;
    return true;
}

#include "runtime/Esp32BaseRecordStore.inc"
#include "runtime/Esp32BaseConditions.inc"
#include "runtime/Esp32BaseStorage.inc"

void setUp() { resetHarness(); }
void tearDown() {}

std::string controlPath(const Esp32BaseRecordStore& store) {
    return std::string(store.path()) + "/control.bin";
}

std::string segmentPath(const Esp32BaseRecordStore& store, uint32_t firstId = 1) {
    char path[128];
    std::snprintf(path, sizeof(path), "%s/%08lx.seg", store.path(),
                  static_cast<unsigned long>(firstId));
    return path;
}

void appendRecords(Esp32BaseRecordStore& store, uint32_t first, uint32_t last) {
    uint8_t bytes[8];
    for (uint32_t id = first; id <= last; ++id) {
        payload(bytes, id);
        ++g_time.uptimeSec;
        TEST_ASSERT_TRUE(store.appendInstant(bytes, sizeof(bytes)));
    }
}

void test_create_calculates_capacity_and_store_budget() {
    Esp32BaseRecordStore store;
    TEST_ASSERT_TRUE(store.begin(definition()));
    Esp32BaseRecordStore::StoreStatus status;
    TEST_ASSERT_TRUE(store.readStatus(status));
    TEST_ASSERT_EQUAL_UINT32(2, status.capacity);
    TEST_ASSERT_EQUAL_UINT32(32, status.slotSizeBytes);
    TEST_ASSERT_EQUAL_UINT32(4096, status.segmentFileLimitBytes);
    TEST_ASSERT_EQUAL_UINT32(0, status.segmentCount);
    TEST_ASSERT_EQUAL_UINT32(128, status.currentStoreBytes);
    TEST_ASSERT_EQUAL_UINT32(224, status.maximumStoreBytes);
    TEST_ASSERT_EQUAL_STRING("/esp32base/records/watering.v1", status.path);
    TEST_ASSERT_TRUE(Esp32BaseFs::exists(controlPath(store).c_str()));
    TEST_ASSERT_EQUAL_UINT32(0, g_fixedSlotVisitCalls);
}

void test_segment_rotation_reads_latest_first() {
    Esp32BaseRecordStore store;
    TEST_ASSERT_TRUE(store.begin(definition("watering", 1, 4320)));
    appendRecords(store, 1, 132);
    IdCollector collected;
    uint8_t scratch[8];
    TEST_ASSERT_TRUE(store.readLatest(0, 10, scratch, sizeof(scratch), collectId, &collected));
    TEST_ASSERT_EQUAL_UINT32(5, collected.ids.size());
    TEST_ASSERT_EQUAL_UINT32(132, collected.ids[0]);
    TEST_ASSERT_EQUAL_UINT32(131, collected.ids[1]);
    TEST_ASSERT_EQUAL_UINT32(130, collected.ids[2]);
    Esp32BaseRecordStore::StoreStatus status;
    TEST_ASSERT_TRUE(store.readStatus(status));
    TEST_ASSERT_EQUAL_UINT32(5, status.recordCount);
    TEST_ASSERT_TRUE(status.currentStoreBytes <= status.maximumStoreBytes);
    TEST_ASSERT_EQUAL_UINT32(1, status.segmentCount);
    TEST_ASSERT_FALSE(Esp32BaseFs::exists(segmentPath(store, 1).c_str()));
    TEST_ASSERT_TRUE(Esp32BaseFs::exists(segmentPath(store, 128).c_str()));
}

void test_smaller_budget_removes_oversized_old_segment_and_resets_visible_range() {
    Esp32BaseRecordStore original;
    TEST_ASSERT_TRUE(original.begin(definition("watering", 1, 4320)));
    appendRecords(original, 1, 132);

    Esp32BaseRecordStore reopened;
    TEST_ASSERT_TRUE(reopened.begin(definition("watering", 1, 224)));
    Esp32BaseRecordStore::StoreStatus status;
    TEST_ASSERT_TRUE(reopened.readStatus(status));
    TEST_ASSERT_EQUAL_UINT32(0, status.recordCount);
    TEST_ASSERT_EQUAL_UINT32(0, status.oldestRecordId);
    TEST_ASSERT_EQUAL_UINT32(0, status.newestRecordId);
    TEST_ASSERT_EQUAL_UINT32(133, status.nextRecordId);
    TEST_ASSERT_EQUAL_UINT32(128, status.currentStoreBytes);
}

