tangyangguang/Esp32Base/test/test_native_record_store_harness/test_main.cpp
void test_completed_record_uses_duration_and_resolves_time() {
    Esp32BaseRecordStore store;
    TEST_ASSERT_TRUE(store.begin(definition()));
    Esp32BaseRecordStore::RecordStartTime start;
    TEST_ASSERT_TRUE(store.captureStartTime(start));
    g_time.uptimeSec = 40;
    g_time.synced = true;
    g_time.epochSec = 1700000040UL;
    g_time.bootStartEpochSec = 1700000000UL;
    uint8_t bytes[8]; payload(bytes, 1);
    TEST_ASSERT_TRUE(store.appendCompleted(start, bytes, sizeof(bytes)));
    Esp32BaseRecordStore::RecordMetadata record;
    uint8_t output[8];
    TEST_ASSERT_EQUAL(Esp32BaseRecordStore::RecordReadResult::Found, store.readById(1, output, sizeof(output), record));
    TEST_ASSERT_EQUAL_UINT32(30, record.timing.durationSec);
    uint32_t epoch = 0;
    TEST_ASSERT_TRUE(Esp32BaseRecordStore::resolveStartedEpoch(record.timing, epoch));
    TEST_ASSERT_EQUAL_UINT32(1700000010UL, epoch);
}

void test_corrupt_record_is_skipped_and_reported() {
    Esp32BaseRecordStore store;
    TEST_ASSERT_TRUE(store.begin(definition()));
    uint8_t bytes[8]; payload(bytes, 1);
    TEST_ASSERT_TRUE(store.appendInstant(bytes, sizeof(bytes)));
    g_files[segmentPath(store)][32 + 20] ^= 0x55;
    TEST_ASSERT_TRUE(store.reload());
    Esp32BaseRecordStore::StoreStatus status;
    store.readStatus(status);
    TEST_ASSERT_EQUAL(Esp32BaseRecordStore::StoreState::Degraded, status.state);
    TEST_ASSERT_EQUAL_UINT32(1, status.damagedRecordCount);
    TEST_ASSERT_EQUAL_UINT32(0, status.recordCount);
}

void test_corrupt_record_id_is_reported_and_read_as_corrupt() {
    Esp32BaseRecordStore store;
    TEST_ASSERT_TRUE(store.begin(definition()));
    uint8_t bytes[8]; payload(bytes, 1);
    TEST_ASSERT_TRUE(store.appendInstant(bytes, sizeof(bytes)));
    TEST_ASSERT_TRUE(store.appendInstant(bytes, sizeof(bytes)));
    g_files[segmentPath(store)][32] ^= 0x55;
    TEST_ASSERT_TRUE(store.reload());
    Esp32BaseRecordStore::StoreStatus status;
    store.readStatus(status);
    TEST_ASSERT_EQUAL(Esp32BaseRecordStore::StoreState::Degraded, status.state);
    TEST_ASSERT_EQUAL_UINT32(1, status.damagedRecordCount);
    TEST_ASSERT_EQUAL_UINT32(1, status.recordCount);
    Esp32BaseRecordStore::RecordMetadata record;
    uint8_t output[8];
    TEST_ASSERT_EQUAL(Esp32BaseRecordStore::RecordReadResult::Corrupt,
                      store.readById(1, output, sizeof(output), record));
}

void test_torn_tail_is_reserved_and_never_returned() {
    Esp32BaseRecordStore store;
    TEST_ASSERT_TRUE(store.begin(definition("feeding", 1, 4320)));
    appendRecords(store, 1, 1);
    std::vector<uint8_t>& segment = g_files[segmentPath(store)];
    const uint8_t partial[] = {2, 0, 0, 0, 0xAA, 0xBB, 0xCC};
    segment.insert(segment.end(), partial, partial + sizeof(partial));
    TEST_ASSERT_TRUE(store.reload());
    Esp32BaseRecordStore::StoreStatus status;
    TEST_ASSERT_TRUE(store.readStatus(status));
    TEST_ASSERT_EQUAL(Esp32BaseRecordStore::StoreState::Degraded, status.state);
    TEST_ASSERT_EQUAL_UINT32(1, status.damagedRecordCount);
    TEST_ASSERT_EQUAL_UINT32(3, status.nextRecordId);
    Esp32BaseRecordStore::RecordMetadata record;
    uint8_t output[8];
    TEST_ASSERT_EQUAL(Esp32BaseRecordStore::RecordReadResult::Corrupt,
                      store.readById(2, output, sizeof(output), record));
    uint8_t bytes[8]; payload(bytes, 3);
    ++g_time.uptimeSec;
    TEST_ASSERT_TRUE(store.appendInstant(bytes, sizeof(bytes)));
    TEST_ASSERT_TRUE(Esp32BaseFs::exists(segmentPath(store, 3).c_str()));
    TEST_ASSERT_EQUAL(Esp32BaseRecordStore::RecordReadResult::Found,
                      store.readById(3, output, sizeof(output), record));
}

void test_corrupt_segment_header_is_skipped_but_store_remains_writable() {
    Esp32BaseRecordStore store;
    TEST_ASSERT_TRUE(store.begin(definition("feeding", 1, 4320)));
    appendRecords(store, 1, 1);
    g_files[segmentPath(store)][0] ^= 0x5A;
    TEST_ASSERT_TRUE(store.reload());
    Esp32BaseRecordStore::StoreStatus status;
    store.readStatus(status);
    TEST_ASSERT_EQUAL(Esp32BaseRecordStore::StoreState::Degraded, status.state);
    TEST_ASSERT_EQUAL(Esp32BaseRecordStore::StoreError::HeaderInvalid, status.error);
    TEST_ASSERT_EQUAL_UINT32(1, status.damagedRecordCount);
    Esp32BaseRecordStore::RecordMetadata record;
    uint8_t output[8];
    TEST_ASSERT_EQUAL(Esp32BaseRecordStore::RecordReadResult::Corrupt,
                      store.readById(1, output, sizeof(output), record));
    uint8_t bytes[8]; payload(bytes, 2);
    TEST_ASSERT_FALSE(store.appendInstant(bytes, sizeof(bytes) - 1));
    TEST_ASSERT_EQUAL(Esp32BaseRecordStore::StoreError::InvalidPayload, store.lastError());
    ++g_time.uptimeSec;
    TEST_ASSERT_TRUE(store.appendInstant(bytes, sizeof(bytes)));
    TEST_ASSERT_EQUAL(Esp32BaseRecordStore::StoreError::HeaderInvalid, store.lastError());
    TEST_ASSERT_EQUAL(Esp32BaseRecordStore::RecordReadResult::Found,
                      store.readById(2, output, sizeof(output), record));
}

void test_tiny_corrupt_segment_reserves_its_filename_id() {
    Esp32BaseRecordStore store;
    TEST_ASSERT_TRUE(store.begin(definition("feeding", 1, 4320)));
    appendRecords(store, 1, 1);
    g_files[segmentPath(store, 2)] = std::vector<uint8_t>();
    TEST_ASSERT_TRUE(store.reload());
    Esp32BaseRecordStore::StoreStatus status;
    TEST_ASSERT_TRUE(store.readStatus(status));
    TEST_ASSERT_EQUAL(Esp32BaseRecordStore::StoreState::Degraded, status.state);
    TEST_ASSERT_EQUAL(Esp32BaseRecordStore::StoreError::HeaderInvalid, status.error);
    TEST_ASSERT_EQUAL_UINT32(1, status.damagedRecordCount);
    TEST_ASSERT_EQUAL_UINT32(3, status.nextRecordId);
}

void test_overlapping_segment_ranges_are_a_structural_fault() {
    Esp32BaseRecordStore store;
    TEST_ASSERT_TRUE(store.begin(definition("feeding", 1, 8192)));
    appendRecords(store, 1, 2);
    g_files[segmentPath(store, 2)] = g_files[segmentPath(store, 1)];
    TEST_ASSERT_FALSE(store.reload());
    TEST_ASSERT_EQUAL(Esp32BaseRecordStore::StoreState::StructuralFault, store.state());
    TEST_ASSERT_EQUAL(Esp32BaseRecordStore::StoreError::SegmentOverlap, store.lastError());
}

