tangyangguang/Esp32Base/test/test_native_record_store_harness/test_main.cpp
    nativeMillisValue() = 3000;
    TEST_ASSERT_EQUAL(Esp32BaseConditions::ObservationResult::RecoveryConfirmationPending,
                      Esp32BaseConditions::observe(tracker, Esp32BaseConditions::ObservedState::Inactive));
    nativeMillisValue() = 5000;
    TEST_ASSERT_EQUAL(Esp32BaseConditions::ObservationResult::Recovered,
                      Esp32BaseConditions::observe(tracker, Esp32BaseConditions::ObservedState::Inactive));
    TEST_ASSERT_TRUE(Esp32BaseConditions::isActive(1, active));
    TEST_ASSERT_FALSE(active);
}

void test_unknown_condition_observation_cancels_confirmation() {
    TEST_ASSERT_TRUE(Esp32BaseConditions::begin());
    Esp32BaseConditions::ConditionTracker tracker(2, 1000, 1000);
    TEST_ASSERT_EQUAL(Esp32BaseConditions::ObservationResult::ActivationConfirmationPending,
                      Esp32BaseConditions::observe(tracker, Esp32BaseConditions::ObservedState::Active));
    nativeMillisValue() = 500;
    TEST_ASSERT_EQUAL(Esp32BaseConditions::ObservationResult::ObservationUnknown,
                      Esp32BaseConditions::observe(tracker, Esp32BaseConditions::ObservedState::Unknown));
    nativeMillisValue() = 1000;
    TEST_ASSERT_EQUAL(Esp32BaseConditions::ObservationResult::ActivationConfirmationPending,
                      Esp32BaseConditions::observe(tracker, Esp32BaseConditions::ObservedState::Active));
    nativeMillisValue() = 1999;
    TEST_ASSERT_EQUAL(Esp32BaseConditions::ObservationResult::ActivationConfirmationPending,
                      Esp32BaseConditions::observe(tracker, Esp32BaseConditions::ObservedState::Active));
    TEST_ASSERT_EQUAL_UINT32(0, g_conditionStateWriteCount);
}

void test_condition_state_is_restored_without_history_dependency() {
    TEST_ASSERT_TRUE(Esp32BaseConditions::begin());
    Esp32BaseConditions::ConditionTracker firstBoot(4, 0, 0);
    TEST_ASSERT_EQUAL(Esp32BaseConditions::ObservationResult::Activated,
                      Esp32BaseConditions::observe(firstBoot, Esp32BaseConditions::ObservedState::Active));
    TEST_ASSERT_EQUAL_HEX32(1UL << 3U, g_persistedActiveConditionIdBits);

    TEST_ASSERT_TRUE(Esp32BaseConditions::begin());
    Esp32BaseConditions::ConditionTracker nextBoot(4, 0, 0);
    TEST_ASSERT_EQUAL(Esp32BaseConditions::ObservationResult::ConditionUnchanged,
                      Esp32BaseConditions::observe(nextBoot, Esp32BaseConditions::ObservedState::Active));
    Esp32BaseConditions::ConditionsStatus status;
    TEST_ASSERT_TRUE(Esp32BaseConditions::readStatus(status));
    TEST_ASSERT_EQUAL_UINT8(1, status.activeConditionCount);
}

void test_condition_write_failure_does_not_publish_transition_or_change_ram() {
    TEST_ASSERT_TRUE(Esp32BaseConditions::begin());
    Esp32BaseConditions::ConditionTracker tracker(5, 0, 0);
    g_conditionStateWriteFails = true;
    TEST_ASSERT_EQUAL(Esp32BaseConditions::ObservationResult::StateWriteFailed,
                      Esp32BaseConditions::observe(tracker, Esp32BaseConditions::ObservedState::Active));
    bool active = true;
    TEST_ASSERT_TRUE(Esp32BaseConditions::isActive(5, active));
    TEST_ASSERT_FALSE(active);

    g_conditionStateWriteFails = false;
    TEST_ASSERT_EQUAL(Esp32BaseConditions::ObservationResult::Activated,
                      Esp32BaseConditions::observe(tracker, Esp32BaseConditions::ObservedState::Active));
    TEST_ASSERT_TRUE(Esp32BaseConditions::isActive(5, active));
    TEST_ASSERT_TRUE(active);
}

void test_condition_arguments_duplicates_and_forget_are_bounded() {
    TEST_ASSERT_TRUE(Esp32BaseConditions::begin());
    Esp32BaseConditions::ConditionTracker invalid(0, 0, 0);
    TEST_ASSERT_EQUAL(Esp32BaseConditions::ObservationResult::InvalidArgument,
                      Esp32BaseConditions::observe(invalid, Esp32BaseConditions::ObservedState::Active));

    Esp32BaseConditions::ConditionTracker first(8, 0, 0);
    Esp32BaseConditions::ConditionTracker duplicate(8, 0, 0);
    TEST_ASSERT_EQUAL(Esp32BaseConditions::ObservationResult::ConditionUnchanged,
                      Esp32BaseConditions::observe(first, Esp32BaseConditions::ObservedState::Inactive));
    TEST_ASSERT_EQUAL(Esp32BaseConditions::ObservationResult::InvalidArgument,
                      Esp32BaseConditions::observe(duplicate, Esp32BaseConditions::ObservedState::Inactive));
    TEST_ASSERT_TRUE(Esp32BaseConditions::forget(8));

    Esp32BaseConditions::ConditionTracker replacement(8, 0, 0);
    TEST_ASSERT_EQUAL(Esp32BaseConditions::ObservationResult::Activated,
                      Esp32BaseConditions::observe(replacement, Esp32BaseConditions::ObservedState::Active));
    TEST_ASSERT_TRUE(Esp32BaseConditions::forgetAll());
    Esp32BaseConditions::ConditionsStatus status;
    TEST_ASSERT_TRUE(Esp32BaseConditions::readStatus(status));
    TEST_ASSERT_EQUAL_UINT8(0, status.activeConditionCount);
}

void test_storage_coordinates_multiple_stores_capacity_paths_maintenance_and_format() {
    // OTA remains available as a recovery path even when Storage has not
    // mounted successfully; suspension still blocks any concurrent FS writer.
    TEST_ASSERT_TRUE(Esp32BaseStorage::setOtaWriteSuspended(true));
    TEST_ASSERT_TRUE(Esp32BaseStorage::setOtaWriteSuspended(false));
    TEST_ASSERT_EQUAL(Esp32BaseStorage::StorageState::Unavailable,
                      Esp32BaseStorage::state());

    g_totalBytes = 64UL * 1024UL;
    TEST_ASSERT_FALSE(Esp32BaseStorage::begin());
    TEST_ASSERT_EQUAL(Esp32BaseStorage::StorageError::PartitionBudgetExceeded,
                      Esp32BaseStorage::lastError());
    g_totalBytes = 1024UL * 1024UL;
    Esp32BaseStorage::FormatResult recoveryFormat;
    TEST_ASSERT_TRUE(Esp32BaseStorage::formatAndReload(recoveryFormat));
    TEST_ASSERT_TRUE(recoveryFormat.mountSuccess);
    TEST_ASSERT_TRUE(Esp32BaseStorage::begin());

    Esp32BaseRecordStore::StoreDefinition wateringDefinition = definition(
        "watering-coordinated", 1, 384UL * 1024UL);
    Esp32BaseRecordStore::StoreDefinition auditDefinition = definition(
        "audit-coordinated", 1, 128UL * 1024UL);
    auditDefinition.retentionPolicy = Esp32BaseRecordStore::RetentionPolicy::PreserveUnreleased;
    Esp32BaseRecordStore wateringStore;
    Esp32BaseRecordStore auditStore;
    TEST_ASSERT_TRUE(wateringStore.begin(wateringDefinition));
    TEST_ASSERT_TRUE(auditStore.begin(auditDefinition));
    TEST_ASSERT_TRUE(Esp32BaseStorage::registerRecordStore(wateringStore));
    TEST_ASSERT_TRUE(Esp32BaseStorage::registerRecordStore(auditStore));
    TEST_ASSERT_EQUAL_UINT8(2, Esp32BaseStorage::recordStoreCount());
    TEST_ASSERT_TRUE(Esp32BaseStorage::registerRecordStore(wateringStore));
    TEST_ASSERT_EQUAL_UINT8(2, Esp32BaseStorage::recordStoreCount());

