tangyangguang/Esp32Base/test/test_native_record_store_harness/test_main.cpp
    Esp32BaseRecordStore overflowStore;
    TEST_ASSERT_TRUE(overflowStore.begin(definition("overflow", 1, 32UL * 1024UL)));
    TEST_ASSERT_FALSE(Esp32BaseStorage::registerRecordStore(overflowStore));
    TEST_ASSERT_EQUAL(Esp32BaseStorage::StorageError::RecordBudgetExceeded,
                      Esp32BaseStorage::lastError());

    TEST_ASSERT_TRUE(Esp32BaseStorage::isManagedPath(wateringStore.path()));
    TEST_ASSERT_TRUE(Esp32BaseStorage::isManagedPath("/esp32base/internal.tmp"));
    TEST_ASSERT_TRUE(Esp32BaseStorage::isManagedPath(
        "/esp32base/records/watering-coordinated.v1/segment-00000001.bin"));
    TEST_ASSERT_FALSE(Esp32BaseStorage::isManagedPath("/uploads/user.json"));
    TEST_ASSERT_TRUE(Esp32BaseStorage::unmanagedWritableBytes() >= 250UL * 1024UL);
    TEST_ASSERT_TRUE(Esp32BaseStorage::unmanagedWritableBytes() < 256UL * 1024UL);

    TEST_ASSERT_TRUE(Esp32BaseStorage::setOtaWriteSuspended(true));
    Esp32BaseStorage::StorageStatus storageStatus;
    TEST_ASSERT_TRUE(Esp32BaseStorage::readStatus(storageStatus));
    TEST_ASSERT_EQUAL(Esp32BaseStorage::StorageState::OtaWriteSuspended, storageStatus.state);
    TEST_ASSERT_TRUE(storageStatus.writesSuspended);
    TEST_ASSERT_TRUE(Esp32BaseStorage::setOtaWriteSuspended(false));

    uint8_t bytes[8];
    payload(bytes, 42);
    TEST_ASSERT_TRUE(wateringStore.appendInstant(bytes, sizeof(bytes)));
    TEST_ASSERT_TRUE(auditStore.appendInstant(bytes, sizeof(bytes)));
    Esp32BaseStorage::ClearResult clearResult;
    const auto beforeClear = g_files;
    TEST_ASSERT_FALSE(Esp32BaseStorage::clearRecordStores(clearResult));
    TEST_ASSERT_EQUAL_UINT8(0, clearResult.recordStoreClearedCount);
    TEST_ASSERT_EQUAL_INT((int)Esp32BaseStorage::StorageError::RecordsProtected, (int)Esp32BaseStorage::lastError());
    TEST_ASSERT_TRUE(g_files == beforeClear);
    TEST_ASSERT_TRUE(auditStore.releaseThrough(1));
    const auto beforeCheckpoint = g_files;
    g_fileSystemWriteFails = true;
    TEST_ASSERT_TRUE(Esp32BaseStorage::setOtaWriteSuspended(true));
    TEST_ASSERT_TRUE(g_fsWritesSuspended); // Failed checkpoint cannot veto recovery OTA.
    TEST_ASSERT_TRUE(g_files == beforeCheckpoint);
    TEST_ASSERT_EQUAL(Esp32BaseRecordStore::StoreState::WriteFault, auditStore.state());
    TEST_ASSERT_TRUE(Esp32BaseStorage::setOtaWriteSuspended(false));
    g_fileSystemWriteFails = false;
    TEST_ASSERT_TRUE(auditStore.reload());
    Esp32BaseRecordStore::StoreStatus auditStatus;
    TEST_ASSERT_TRUE(auditStore.readStatus(auditStatus));
    TEST_ASSERT_EQUAL_UINT32(0, auditStatus.releasedThroughRecordId);
    TEST_ASSERT_TRUE(auditStore.releaseThrough(1));
    TEST_ASSERT_TRUE(Esp32BaseStorage::setOtaWriteSuspended(true));
    TEST_ASSERT_TRUE(auditStore.readStatus(auditStatus));
    TEST_ASSERT_EQUAL_UINT32(1, auditStatus.checkpointedReleaseRecordId);
    TEST_ASSERT_TRUE(Esp32BaseStorage::setOtaWriteSuspended(false));
    const uint32_t checkpointWrites = g_controlWriteAttempts;
    esp32base_internal::checkpointRecordStoresForMaintenance();
    TEST_ASSERT_EQUAL_UINT32(checkpointWrites, g_controlWriteAttempts);
    TEST_ASSERT_TRUE(Esp32BaseStorage::clearRecordStores(clearResult));
    TEST_ASSERT_TRUE(clearResult.allCleared);
    TEST_ASSERT_EQUAL_UINT8(2, clearResult.recordStoreClearedCount);

    Esp32BaseStorage::FormatResult formatResult;
    TEST_ASSERT_TRUE(Esp32BaseStorage::formatAndReload(formatResult));
    TEST_ASSERT_TRUE(formatResult.formatSuccess);
    TEST_ASSERT_TRUE(formatResult.mountSuccess);
    TEST_ASSERT_EQUAL_UINT8(2, formatResult.recordStoreReloadedCount);
}

void test_store_status_reads_one_fresh_capacity_snapshot_and_handles_failure() {
    Esp32BaseRecordStore store;
    TEST_ASSERT_TRUE(store.begin(definition()));
    Esp32BaseRecordStore::StoreStatus status;
    uint32_t calls = g_storageInfoCalls;
    const uint32_t writes = g_controlWriteAttempts;
    TEST_ASSERT_TRUE(store.readStatus(status));
    TEST_ASSERT_EQUAL_UINT32(calls + 1, g_storageInfoCalls);
    TEST_ASSERT_EQUAL_UINT32(g_totalBytes, status.fileSystemTotalBytes);
    TEST_ASSERT_EQUAL_UINT32(status.fileSystemTotalBytes - status.fileSystemUsedBytes,
                             status.fileSystemFreeBytes);
    g_totalBytes = 1; // Fresh query, no stale cache; used may exceed reported total.
    TEST_ASSERT_TRUE(store.readStatus(status));
    TEST_ASSERT_EQUAL_UINT32(1, status.fileSystemTotalBytes);
    TEST_ASSERT_EQUAL_UINT32(0, status.fileSystemFreeBytes);
    g_storageInfoFails = true; // SDK may fill outputs and still report failure.
    TEST_ASSERT_TRUE(store.readStatus(status));
    TEST_ASSERT_EQUAL_UINT32(0, status.fileSystemTotalBytes);
    TEST_ASSERT_EQUAL_UINT32(0, status.fileSystemUsedBytes);
    TEST_ASSERT_EQUAL_UINT32(0, status.fileSystemFreeBytes);
    TEST_ASSERT_EQUAL_UINT32(writes, g_controlWriteAttempts);
}

void test_protected_records_survive_full_clear_reload_and_smaller_budget() {
    auto d = definition("protected", 1, 224);
    d.retentionPolicy = Esp32BaseRecordStore::RetentionPolicy::PreserveUnreleased;
    Esp32BaseRecordStore store;
    TEST_ASSERT_TRUE(store.begin(d));
    uint8_t bytes[8] = {};
    TEST_ASSERT_TRUE(store.appendInstant(bytes, sizeof(bytes)));
    TEST_ASSERT_TRUE(store.appendInstant(bytes, sizeof(bytes)));
    const auto files = g_files;
    TEST_ASSERT_FALSE(store.appendInstant(bytes, sizeof(bytes)));
    TEST_ASSERT_EQUAL_INT((int)Esp32BaseRecordStore::StoreError::RecordsProtected, (int)store.lastError());
    TEST_ASSERT_FALSE(store.isWritable());
    TEST_ASSERT_FALSE(store.clear());
    TEST_ASSERT_TRUE(g_files == files);
    TEST_ASSERT_TRUE(store.reload());
    d.maximumStoreBytes = 192;
    Esp32BaseRecordStore smaller;
    TEST_ASSERT_TRUE(smaller.begin(d));
    TEST_ASSERT_TRUE(g_files == files);
    TEST_ASSERT_EQUAL_INT((int)Esp32BaseRecordStore::StoreError::RecordsProtected, (int)smaller.lastError());
}

void test_release_is_ram_only_and_rotation_checkpoints_before_delete() {
    auto d = definition("protected", 1, 224);
    d.retentionPolicy = Esp32BaseRecordStore::RetentionPolicy::PreserveUnreleased;
    Esp32BaseRecordStore store;
    TEST_ASSERT_TRUE(store.begin(d));
    uint8_t bytes[8] = {};
    TEST_ASSERT_TRUE(store.appendInstant(bytes, sizeof(bytes)));
    TEST_ASSERT_TRUE(store.appendInstant(bytes, sizeof(bytes)));
    const auto files = g_files;
    const uint32_t beforeReleaseWrites = g_controlWriteAttempts;
    TEST_ASSERT_FALSE(store.releaseThrough(3));
    TEST_ASSERT_TRUE(store.releaseThrough(1));
    TEST_ASSERT_FALSE(store.releaseThrough(0));
    TEST_ASSERT_EQUAL_UINT32(beforeReleaseWrites, g_controlWriteAttempts);
    TEST_ASSERT_TRUE(g_files == files);
    TEST_ASSERT_FALSE(store.appendInstant(bytes, sizeof(bytes))); // Same segment still contains record 2.
    TEST_ASSERT_TRUE(store.reload());
    Esp32BaseRecordStore::StoreStatus before;
    TEST_ASSERT_TRUE(store.readStatus(before));
    TEST_ASSERT_EQUAL_UINT32(0, before.releasedThroughRecordId);
    TEST_ASSERT_TRUE(store.releaseThrough(2));
    g_fileSystemWriteFails = true;
    TEST_ASSERT_FALSE(store.appendInstant(bytes, sizeof(bytes)));
    TEST_ASSERT_TRUE(g_files == files); // Failed checkpoint cannot permit pruning.
    g_fileSystemWriteFails = false;
    TEST_ASSERT_TRUE(store.reload());
    TEST_ASSERT_TRUE(store.releaseThrough(2));
    TEST_ASSERT_TRUE(store.appendInstant(bytes, sizeof(bytes)));
    TEST_ASSERT_TRUE(store.reload());
    Esp32BaseRecordStore::StoreStatus after;
    TEST_ASSERT_TRUE(store.readStatus(after));
    TEST_ASSERT_EQUAL_UINT32(2, after.checkpointedReleaseRecordId);
    TEST_ASSERT_EQUAL_UINT32(3, after.oldestRecordId);
    TEST_ASSERT_EQUAL_UINT32(4, after.nextRecordId);
    TEST_ASSERT_EQUAL_MEMORY(before.storageGeneration, after.storageGeneration, 16);
    TEST_ASSERT_TRUE(store.releaseThrough(3));
    TEST_ASSERT_TRUE(store.checkpointRelease());
    TEST_ASSERT_TRUE(store.reload());
    TEST_ASSERT_TRUE(store.readStatus(after));
    TEST_ASSERT_EQUAL_UINT32(3, after.releasedThroughRecordId);
    TEST_ASSERT_TRUE(store.clear());
    TEST_ASSERT_TRUE(store.reload());
    TEST_ASSERT_TRUE(store.readStatus(after));
    TEST_ASSERT_EQUAL_UINT32(4, after.nextRecordId);
    TEST_ASSERT_EQUAL_MEMORY(before.storageGeneration, after.storageGeneration, 16);
    const auto clearedFiles = g_files;
    const uint32_t checkpointWrites = g_controlWriteAttempts;
    TEST_ASSERT_TRUE(store.checkpointRelease());
    TEST_ASSERT_EQUAL_UINT32(checkpointWrites, g_controlWriteAttempts);
    TEST_ASSERT_TRUE(g_files == clearedFiles);
}

