tangyangguang/Esp32Base/test/test_native_record_store_harness/test_main.cpp
void test_store_generation_and_retention_definition_are_persistent() {
    Esp32BaseRecordStore store;
    auto d = definition();
    TEST_ASSERT_TRUE(store.begin(d));
    Esp32BaseRecordStore::StoreStatus first;
    TEST_ASSERT_TRUE(store.readStatus(first));
    TEST_ASSERT_EQUAL_UINT8(0x40, first.storageGeneration[6] & 0xf0);
    TEST_ASSERT_EQUAL_UINT8(0x80, first.storageGeneration[8] & 0xc0);
    TEST_ASSERT_TRUE(store.reload());
    Esp32BaseRecordStore::StoreStatus second;
    TEST_ASSERT_TRUE(store.readStatus(second));
    TEST_ASSERT_EQUAL_MEMORY(first.storageGeneration, second.storageGeneration, 16);
    const auto files = g_files;
    d.retentionPolicy = Esp32BaseRecordStore::RetentionPolicy::PreserveUnreleased;
    TEST_ASSERT_FALSE(store.begin(d));
    TEST_ASSERT_TRUE(g_files == files);
    Esp32BaseRecordStore other;
    TEST_ASSERT_TRUE(other.begin(definition("second")));
    TEST_ASSERT_TRUE(other.readStatus(second));
    TEST_ASSERT_TRUE(memcmp(first.storageGeneration, second.storageGeneration, 16) != 0);
}

void test_rotation_failure_does_not_reuse_ids_and_checkpoint_tail_can_recover() {
    Esp32BaseRecordStore store;
    TEST_ASSERT_TRUE(store.begin(definition()));
    uint8_t bytes[8] = {};
    TEST_ASSERT_TRUE(store.appendInstant(bytes, sizeof(bytes)));
    TEST_ASSERT_TRUE(store.appendInstant(bytes, sizeof(bytes)));
    g_segmentCreateFails = true;
    TEST_ASSERT_FALSE(store.appendInstant(bytes, sizeof(bytes)));
    g_segmentCreateFails = false;
    TEST_ASSERT_TRUE(store.reload());
    Esp32BaseRecordStore::StoreStatus status;
    TEST_ASSERT_TRUE(store.readStatus(status));
    TEST_ASSERT_EQUAL_UINT32(3, status.nextRecordId);
    TEST_ASSERT_TRUE(store.appendInstant(bytes, sizeof(bytes)));

    Esp32BaseRecordStore protectedStore;
    auto d = definition("protected");
    d.retentionPolicy = Esp32BaseRecordStore::RetentionPolicy::PreserveUnreleased;
    TEST_ASSERT_TRUE(protectedStore.begin(d));
    TEST_ASSERT_TRUE(protectedStore.appendInstant(bytes, sizeof(bytes)));
    TEST_ASSERT_TRUE(protectedStore.releaseThrough(1));
    TEST_ASSERT_TRUE(protectedStore.checkpointRelease());
    auto& control = g_files[std::string(protectedStore.path()) + "/control.bin"];
    control[64 + 52] ^= 0x80; // Torn newest checkpoint, previous header is still valid.
    TEST_ASSERT_TRUE(protectedStore.reload());
    TEST_ASSERT_TRUE(protectedStore.readStatus(status));
    TEST_ASSERT_EQUAL_UINT32(0, status.releasedThroughRecordId);
    TEST_ASSERT_EQUAL_UINT32(2, status.nextRecordId);
    TEST_ASSERT_EQUAL_UINT32(1, status.recordCount);
}

void test_previous_container_is_rejected_without_rewriting_files() {
    Esp32BaseRecordStore store;
    TEST_ASSERT_TRUE(store.begin(definition()));
    auto& control = g_files[std::string(store.path()) + "/control.bin"];
    for (size_t offset : {size_t(0), size_t(64)}) {
        recordStoreWriteU16(control.data() + offset + 4, 1);
        recordStoreWriteU32(control.data() + offset + 32, 0);
        recordStoreWriteU32(control.data() + offset + 32, recordStoreCrc(control.data() + offset, 64));
    }
    const auto files = g_files;
    TEST_ASSERT_FALSE(store.reload());
    TEST_ASSERT_FALSE(store.releaseThrough(1));
    TEST_ASSERT_EQUAL_INT((int)Esp32BaseRecordStore::StoreError::HeaderInvalid, (int)store.lastError());
    TEST_ASSERT_TRUE(g_files == files);
}

int main(int argc, char** argv) {
    UNITY_BEGIN();
    RUN_TEST(test_previous_container_is_rejected_without_rewriting_files);
    RUN_TEST(test_rotation_failure_does_not_reuse_ids_and_checkpoint_tail_can_recover);
    RUN_TEST(test_store_status_reads_one_fresh_capacity_snapshot_and_handles_failure);
    RUN_TEST(test_protected_records_survive_full_clear_reload_and_smaller_budget);
    RUN_TEST(test_release_is_ram_only_and_rotation_checkpoints_before_delete);
    RUN_TEST(test_store_generation_and_retention_definition_are_persistent);
    RUN_TEST(test_create_calculates_capacity_and_store_budget);
    RUN_TEST(test_segment_rotation_reads_latest_first);
    RUN_TEST(test_smaller_budget_removes_oversized_old_segment_and_resets_visible_range);
    RUN_TEST(test_completed_record_uses_duration_and_resolves_time);
    RUN_TEST(test_corrupt_record_is_skipped_and_reported);
    RUN_TEST(test_corrupt_record_id_is_reported_and_read_as_corrupt);
    RUN_TEST(test_torn_tail_is_reserved_and_never_returned);
    RUN_TEST(test_corrupt_segment_header_is_skipped_but_store_remains_writable);
    RUN_TEST(test_tiny_corrupt_segment_reserves_its_filename_id);
    RUN_TEST(test_overlapping_segment_ranges_are_a_structural_fault);
    RUN_TEST(test_clear_hides_records_and_continues_ids);
    RUN_TEST(test_different_versions_use_different_directories);
    RUN_TEST(test_clearing_current_version_does_not_modify_historical_version);
    RUN_TEST(test_existing_control_wrong_size_is_not_rewritten);
    RUN_TEST(test_existing_definition_mismatch_is_not_rewritten);
    RUN_TEST(test_minimum_free_space_blocks_business_store_creation);
    RUN_TEST(test_latest_pagination_crosses_segments);
    RUN_TEST(test_torn_clear_header_falls_back_to_pre_clear_state);
    RUN_TEST(test_clear_boundary_stays_effective_when_segment_cleanup_fails);
    RUN_TEST(test_product_store_budgets_choose_bounded_segments);
    RUN_TEST(test_condition_activation_recovery_and_reactivation_are_debounced);
    RUN_TEST(test_unknown_condition_observation_cancels_confirmation);
    RUN_TEST(test_condition_state_is_restored_without_history_dependency);
    RUN_TEST(test_condition_write_failure_does_not_publish_transition_or_change_ram);
    RUN_TEST(test_condition_arguments_duplicates_and_forget_are_bounded);
    RUN_TEST(test_storage_coordinates_multiple_stores_capacity_paths_maintenance_and_format);
    return UNITY_END();
}
